Módulo 21 <br> Professor: Lucas Serra

# Módulo 21 - Atividade 3

### Calcule a média por nome e sobrenome do ator da seguintes variáveis:
- rental_duration
- rental_rate
- length
- replacement_cost

In [9]:
import pandas as pd
import psycopg as pg

In [10]:
def connect_to_postgres(dbname):
    conn = None
    try:
        print('Conectando no PostgreSQL')
        conn = pg.connect(host='localhost', 
                           port=5432, 
                           dbname=dbname, 
                           user='postgres',
                           password='postgres')
        print("Conectado!")
        
    except Exception as e:
        print(e)       
        conn = None
    return conn

def get_results_postgres(conn, query, fetch = 'all'):
    colnames = None
    data = None
    
    try:
        print('Cursor criado')
        cur = conn.cursor()

        print('Enviando query')
        cur.execute(query)
        print('Query executada')
        conn.commit()

        if fetch=='all':
            data = cur.fetchall()
        elif fetch=='many':
            data = cur.fetchmany()
        elif fetch=='one':
            data = cur.fetchone()
        else:
            return None

        colnames = [desc.name for desc in cur.description]
        cur.close()
        conn.close()
    except Exception as e:
        print(e)
        cur.close()
        conn.close()
    return data, colnames

def to_df(data, colnames):
    print('Transformando em dataframe')
    df = pd.DataFrame(data, columns=colnames)
    print('DF OK')
    return df

In [11]:
# mean for first_name and last_name of the actor for rental_duration
dbname = 'dvd'
query = '''SELECT first_name, last_name, AVG(rental_duration) as rental_duration_mean
            FROM actor as a
                LEFT JOIN film_actor as b
                    on a.actor_id = b.actor_id
                LEFT JOIN film as c
                    on b.film_id = c.film_id
            GROUP BY first_name, last_name;'''

conn = connect_to_postgres(dbname)

data, colnames = get_results_postgres(conn, query, fetch = 'all')

df_results = to_df(data, colnames)
df_results.head()

Conectando no PostgreSQL
Conectado!
Cursor criado
Enviando query
Query executada
Transformando em dataframe
DF OK

  first_name last_name rental_duration_mean
0     Minnie    Kilmer   5.1500000000000000
1      Renee      Ball   4.9696969696969697
2      Thora    Temple   5.0000000000000000
3       Burt   Dukakis   5.5862068965517241
4       Liza   Bergman   5.4400000000000000

In [12]:
# mean for first_name and last_name of the actor for rental_rate
dbname = 'dvd'
query = '''SELECT first_name, last_name, AVG(rental_rate) as rental_rate_mean
            FROM actor as a
                LEFT JOIN film_actor as b
                    on a.actor_id = b.actor_id
                LEFT JOIN film as c
                    on b.film_id = c.film_id
            GROUP BY first_name, last_name;'''

conn = connect_to_postgres(dbname)

data, colnames = get_results_postgres(conn, query, fetch = 'all')

df_results = to_df(data, colnames)
df_results.head()

Conectando no PostgreSQL
Conectado!
Cursor criado
Enviando query
Query executada
Transformando em dataframe
DF OK

  first_name last_name    rental_rate_mean
0     Minnie    Kilmer  3.4900000000000000
1      Renee      Ball  2.9293939393939394
2      Thora    Temple  2.9900000000000000
3       Burt   Dukakis  3.1968965517241379
4       Liza   Bergman  3.5500000000000000

In [13]:
# mean for first_name and last_name of the actor for length
dbname = 'dvd'
query = '''SELECT first_name, last_name, AVG(length) as length_mean
            FROM actor as a
                LEFT JOIN film_actor as b
                    on a.actor_id = b.actor_id
                LEFT JOIN film as c
                    on b.film_id = c.film_id
            GROUP BY first_name, last_name;'''

conn = connect_to_postgres(dbname)

data, colnames = get_results_postgres(conn, query, fetch = 'all')

df_results = to_df(data, colnames)
df_results.head()

Conectando no PostgreSQL
Conectado!
Cursor criado
Enviando query
Query executada
Transformando em dataframe
DF OK

  first_name last_name           length_mean
0     Minnie    Kilmer  111.5000000000000000
1      Renee      Ball  104.3636363636363636
2      Thora    Temple  128.4000000000000000
3       Burt   Dukakis  118.7931034482758621
4       Liza   Bergman  112.3200000000000000

In [14]:
# mean for first_name and last_name of the actor for replacement_cost
dbname = 'dvd'
query = '''SELECT first_name, last_name, AVG(replacement_cost) as replacement_cost_mean
            FROM actor as a
                LEFT JOIN film_actor as b
                    on a.actor_id = b.actor_id
                LEFT JOIN film as c
                    on b.film_id = c.film_id
            GROUP BY first_name, last_name;'''

conn = connect_to_postgres(dbname)

data, colnames = get_results_postgres(conn, query, fetch = 'all')

df_results = to_df(data, colnames)
df_results.head()

Conectando no PostgreSQL
Conectado!
Cursor criado
Enviando query
Query executada
Transformando em dataframe
DF OK

  first_name last_name replacement_cost_mean
0     Minnie    Kilmer   20.2400000000000000
1      Renee      Ball   20.9900000000000000
2      Thora    Temple   19.2900000000000000
3       Burt   Dukakis   20.1279310344827586
4       Liza   Bergman   20.0300000000000000

### Calcule a soma de amount (preço total do aluguel) por nome, sobrenome e email do cliente (customer) e indique os 10 clientes que mais gastaram e os 10 que menos gastaram.

In [17]:
# Sum of amount by first_name, last_name and email of the customer, indicating the 10 customers who spent the most and the 10 who spent the least
dbname = 'dvd'
query = '''SELECT first_name, last_name, email, SUM(amount) as amount_sum
            FROM customer as a
                LEFT JOIN payment as b
                    on a.customer_id = b.customer_id
            GROUP BY first_name, last_name, email
            ORDER BY amount_sum DESC
            LIMIT 10;'''

query2 = '''SELECT first_name, last_name, email, SUM(amount) as amount_sum
            FROM customer as a
                LEFT JOIN payment as b
                    on a.customer_id = b.customer_id
            GROUP BY first_name, last_name, email
            ORDER BY amount_sum ASC
            LIMIT 10;'''

conn = connect_to_postgres(dbname)
data, colnames = get_results_postgres(conn, query, fetch = 'all')

conn = connect_to_postgres(dbname)
data2, colnames2 = get_results_postgres(conn, query2, fetch = 'all')

df_results = to_df(data, colnames)
df_results2 = to_df(data2, colnames2)

Conectando no PostgreSQL
Conectado!
Cursor criado
Enviando query
Query executada
Conectando no PostgreSQL
Conectado!
Cursor criado
Enviando query
Query executada
Transformando em dataframe
DF OK
Transformando em dataframe
DF OK

In [18]:
df_results.head()

  first_name last_name                              email amount_sum
0    Eleanor      Hunt    eleanor.hunt@sakilacustomer.org     211.55
1       Karl      Seal       karl.seal@sakilacustomer.org     208.58
2     Marion    Snyder   marion.snyder@sakilacustomer.org     194.61
3     Rhonda   Kennedy  rhonda.kennedy@sakilacustomer.org     191.62
4      Clara      Shaw      clara.shaw@sakilacustomer.org     189.60

In [19]:
df_results2.head()

  first_name last_name                               email amount_sum
0      Brian     Wyman      brian.wyman@sakilacustomer.org      27.93
1      Leona    Obrien     leona.obrien@sakilacustomer.org      32.90
2   Caroline    Bowman  caroline.bowman@sakilacustomer.org      37.87
3    Anthony    Schwab   anthony.schwab@sakilacustomer.org      47.85
4    Tiffany    Jordan   tiffany.jordan@sakilacustomer.org      49.88